Revit 2027 API
ParameterTypeId.ModelCategoryIdParam Property
 "Subcategory"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ModelCategoryIdParam { get; }
Public Shared ReadOnly Property ModelCategoryIdParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ModelCategoryIdParam {
	ForgeTypeId^ get ();
}
static member ModelCategoryIdParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace